KanatERPSukhova.КанатАдаптация/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="51b836e4-2654-4a0f-841d-e940e4523122">
    <name>КАНАТ_Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/CommonModules/КАНАТ_События/Module.bsl
// <+БИТ> Руденков_Е.И. 25.07.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
Процедура ЗаписатьВторичныеДанныеПлановыхНачисленийПриОтменеПроведенияДокумента(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.СерииНоменклатуры")
		Или ТипЗнч(Источник) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		
		Штрихкод		= Источник.Номер;
		Номенклатура	= Источник.КАНАТ_Номенклатура;
		Характеристика	= Источник.КАНАТ_Характеристика;
		Упаковка		= Источник.КАНАТ_Упаковка;
		Серия			= Источник.Ссылка;
		
		Если Не ЗначениеЗаполнено(Характеристика)
			Или Не ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат;	
		КонецЕсли;
		
		МассивЗаписей = Новый Массив;
		МассивЗаписей.Добавить(Новый Структура("Штрихкод,Номенклатура,Характеристика,Упаковка,КАНАТ_Серия",
												Штрихкод,Номенклатура,Характеристика,Упаковка,Серия));
												
		РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьЗаписьВРегистр(МассивЗаписей);
	КонецЕсли;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 25.07.2024
